#+TITLE: CMPUT201W20B2 Midterm 2 Practice
#+PROPERTY: header-args:C             :results output :exports no-export :flags -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 :eval yes :results value verbatim
#+PROPERTY: header-args:sh            :results output :exports no-export :eval yes :results value verbatim
#+PROPERTY: header-args:shell         :results output :exports no-export :eval yes :results value verbatim

*** Org export
#+BEGIN_SRC elisp
(org-html-export-to-html)
(org-latex-export-to-pdf)
(org-ascii-export-to-ascii)
#+END_SRC

#+RESULTS:
: ./presentation.txt


*** Bubblesort from Rosetta code

GFDL licensed code.

Please fix this bubblesort code.

#+BEGIN_SRC C :exports both
#include <stdio.h>

/* QUESTION: what should the function declaration of bubble sort be?
   1: nothing
   2:  int * bubble_sort( int a[n], int n) {
   3:  int bubble_sort( int a[n], int n) {
   4:  void bubble_sort( char a[n], int n) {
   5:  void bubble_sort( double a[n], int n) {
   6:  void bubble_sort (int *a, int n) {
   7:  void bubble_sort (int **a, int n) {
   8:  void bubble_sort (int *a) {
   9:  void bubble_sort (int (*)a[n],int n) {
*/
    int i, t, j = n, s = 1;
    while (s) {
        s = 0;
        for (i = 1; i < j; i++) {
            if (a[i] < a[i - 1]) {
                t = a[i];
                a[i] = a[i - 1];
                a[i - 1] = t;
                s = 1;
            }
        }
        j--;
    }
}
 
int main () {
    int a[] = {4, 65, 2, -31, 0, 99, 2, 83, 782, 1};
/* QUESTION: what should the variable n be defined and set to?
    1: double n = 10.0
    2: int n = sizeof(a) / sizeof(a[0]);
    3: int n = sizeof(a);
    4: int n = sizeof(a[0]);
    5: int n = sizeof(a[0])/sizeof(double);
    6: int n = 0;
    7: int n;
*/
    int i;
    // print input
    for (i = 0; i < n; i++) {
        printf("%d%s", a[i], i == n - 1 ? "\n" : " ");
    }
    bubble_sort(a, n);
    // print output
    for (i = 0; i < n; i++) {
        printf("%d%s", a[i], i == n - 1 ? "\n" : " ");
    }
    return 0;
}
#+END_SRC

#+RESULTS:
: 4 65 2 -31 0 99 2 83 782 1
: -31 0 1 2 2 4 65 83 99 782


